terranblake/Esp32_oscilloscope/servers/oscilloscope.h
/*
 
    oscilloscope.h
 
    This file is part of Esp32_web_ftp_telnet_server_template project: https://github.com/BojanJurca/Esp32_oscilloscope
                
    Issues:
            - when WiFi is in WIFI_AP or WIFI_STA_AP mode is oscillospe causes WDT problem when working at higher frequenceses

    May 22, 2024, Bojan Jurca
             
*/


    // ----- includes, definitions and supporting functions -----

    #include <WiFi.h>

    // digitalRead
    #include "driver/gpio.h"
    #include "hal/gpio_hal.h"

//    #include <soc/gpio_sig_map.h> // to digitalRead PWM and other GPIOs ...
    #include <driver/adc.h>       // to use adc1_get_raw instead of analogRead
    #include <driver/i2s.h>

    // fixed size strings    
    #include "std/Cstring.hpp"


#ifndef __OSCILLOSCOPE__
  #define __OSCILLOSCOPE__

    // #define __OSCILLOSCOPE_H_DEBUG__        // uncomment this line for debugging puroposes
    #ifdef __OSCILLOSCOPE_H_DEBUG__
        #define __oscilloscope_h_debug__(X) { Serial.print("__oscilloscope_h_debug__: ");Serial.println(X); }
    #else
        #define __oscilloscope_h_debug__(X) ;
    #endif


    // ----- TUNNING PARAMETERS -----

    #define HTTP_CONNECTION_STACK_SIZE  12 * 1024                     // increase default HTTP_CONNECTION_STACK_SIZE
    #include "httpServer.hpp"

    #define OSCILLOSCOPE_I2S_BUFFER_SIZE 746                          // max number of samples per screen, 746 samples * 2 bytes per sample = 1492 bytes, which must be <= HTTP_WS_FRAME_MAX_SIZE - 8
    #define OSCILLOSCOPE_1SIGNAL_BUFFER_SIZE 373                      // max number of samples per screen, 373 samples * 4 bytes per sample = 1492 bytes, which must be <= HTTP_WS_FRAME_MAX_SIZE - 8
    #define OSCILLOSCOPE_2SIGNALS_BUFFER_SIZE 248                     // max number of samples per screen, 248 samples * 6 bytes per sample = 1488 bytes, which must be <= HTTP_WS_FRAME_MAX_SIZE - 8


    // some ESP32 boards read analog values inverted, uncomment the following line to invert read values back again 
    #define INVERT_ADC1_GET_RAW

    // some ESP32 boards have wI2S interface which improoves analog sampling (for a single signal), uncomment the following line if your bord has an I2S interface
    // #define USE_I2S_INTERFACE

    // some ESP32 boards with I2S interface read analog values inverted, uncomment the following line to invert read values back again 
    // #define INVERT_I2S_READ

    // define a correction factor for sampling frequency if it needs to be corrected
    #define I2S_FREQ_CORRECTION (1.2)


    #ifdef USE_I2S_INTERFACE
        #pragma message "Oscilloscope will use I2S interface (for monitoring a single analog signal) and adc1_get_raw (for monitoring double analog signals)."
    #else
        #pragma message "I2S interface not used or present, Oscilloscope will use adc1_get_raw (for monitoring single and double analog signals)."
    #endif

    // #define OSCILLOSCOPE_READER_CORE 1 // 1 or 0                   // #define OSCILLOSCOPE_READER_CORE if you want oscilloscope reader to run on specific core    
    #ifndef OSCILLOSCOPE_READER_PRIORITY
        #define OSCILLOSCOPE_READER_PRIORITY 1                        // normal priority if not define differently
    #endif


    // ----- CODE -----

    #include "httpServer.hpp"                 // oscilloscope uses websockets defined in webServer.hpp  

    // for digital reading
    static gpio_hal_context_t __gpio_hal__ = {
        .dev = GPIO_HAL_GET_HW (GPIO_PORT_0)
    };        

    // oscilloscope samples
    struct oscI2sSample {                     // one sample
        int16_t signal1;                       // signal value of 1st GPIO read by analogRead or digialRead   
    }; // = 2 bytes per sample

    struct osc1SignalSample {                        // one sample
        int16_t signal1;                       // signal value of 1st GPIO read by analogRead or digialRead   
        int16_t deltaTime;                     // sample time - offset from previous sample in ms or us  
    }; // = 4 bytes per sample

    struct osc2SignalsSample {                        // one sample
        int16_t signal1;                       // signal value of 1st GPIO read by analogRead or digialRead   
        int16_t signal2;                       // signal value of 2nd GPIO if requested   
        int16_t deltaTime;                     // sample time - offset from previous sample in ms or us  
    }; // = 6 bytes per sample
    
    struct oscSamples {                               // buffer with samples
        union {
            oscI2sSample        samplesI2sSignal  [OSCILLOSCOPE_I2S_BUFFER_SIZE];     
            osc1SignalSample    samples1Signal    [OSCILLOSCOPE_1SIGNAL_BUFFER_SIZE];
            osc2SignalsSample   samples2Signals   [OSCILLOSCOPE_2SIGNALS_BUFFER_SIZE];
        };
        unsigned int sampleCount;                      // number of samples in the buffer
        bool samplesAreReady;                          // is the buffer ready for sending
    };

    enum readerState { INITIAL = 0, START = 1, STARTED = 2, STOP = 3, STOPPED = 4 };
    /* transitions:
          START   - set by osc main thread
          STARTED - set by oscReader
          STOP    - set by osc main thread
          STOPPED - set by oscReader
    */

    #define MAX_OSC_CHANNELS 4 // Define maximum number of channels

    // Structure to hold configuration for a single channel
    struct OscChannelConfig {
        gpio_num_t gpio;
        adc1_channel_t adc_channel;
        bool is_analog;
        bool is_active;
        // Add sensitivity, position, trigger settings per channel later
        int sensitivity; // Example: Placeholder for vertical sensitivity (0-5 like original)
        int position;    // Example: Placeholder for vertical position
        bool posTriggerEnabled; // Example: Placeholder
        int posTriggerTreshold; // Example: Placeholder
        bool negTriggerEnabled; // Example: Placeholder
        int negTriggerTreshold; // Example: Placeholder
    };

    struct oscSharedMemory {         // data structure to be shared among oscilloscope tasks
      // basic data for web oscilloscope
      WebSocket *webSocket;                   // open webSocket for communication with javascript client
      bool clientIsBigEndian;                 // true if javascript client is big endian machine
      // basic data for PulseView
      int noOfSamples;
      // sampling sharedMemory
      OscChannelConfig channelConfig[MAX_OSC_CHANNELS]; // Array to hold configs for multiple channels
      uint8_t numActiveChannels;              // Number of currently active channels
      // char readType [8];                      // analog or digital  -> Moved into OscChannelConfig
      // bool analog;                            // true if readType is analog, false if digital (digitalRead) -> Moved into OscChannelConfig
      // gpio_num_t gpio1;                       // gpio where ESP32 is taking samples from (digitalRead) -> Replaced by channelConfig array
      // gpio_num_t gpio2;                       // 2nd gpio if requested -> Replaced by channelConfig array
      // adc1_channel_t adcchannel1;             // channel mapped from gpio ESP32 is taking samples from (adc1_get_raw instead of analogRead) -> Replaced by channelConfig array
      // adc1_channel_t adcchannel2;             // channel mapped from gpio ESP32 is taking samples from (adc1_get_raw instead of analogRead) -> Replaced by channelConfig array
      int samplingTime;                       // time between samples in ms or us - Applies to all channels for now?
      char samplingTimeUnit [3];              // ms or us
      unsigned long screenWidthTime;          // oscilloscope screen width in ms or us
      char screenWidthTimeUnit [3];           // ms or us 
      // bool positiveTrigger;                   // true if posotive slope trigger is set -> Moved into OscChannelConfig?
      // int positiveTriggerTreshold;            // positive slope trigger treshold value -> Moved into OscChannelConfig?
      // bool negativeTrigger;                   // true if negative slope trigger is set   -> Moved into OscChannelConfig?
      // int negativeTriggerTreshold;            // negative slope trigger treshold value -> Moved into OscChannelConfig?
      // buffers holding samples 
      oscSamples readBuffer;                  // we'll read samples into this buffer - Structure might need changing later
      oscSamples sendBuffer;                  // we'll copy red buffer into this buffer before sending samples to the client - Structure might need changing later
      // reader state
      readerState oscReaderState;             // helps to execute a proper stopping sequence
    };

    // oscilloscope reader read samples to read-buffer of shared memory - it will be copied to send buffer when it is ready to be sent


    // oscReaders oscReaders oscReaders oscReaders oscReaders oscReaders oscReaders oscReaders oscReaders oscReaders oscReaders oscReaders 


    // oscReader that takes digital samples (digitalRead) on time interval specified in microseconds
    //  - it can only read 1 or 2 digital signals
    //  - it can only work in 'screen at a time' mode (which is not a drawback for the sampling is measured in microseconds)
    // --- NEW Refactored oscReader_digital Function ---
void oscReader_digital(void *sharedMemory) {
    volatile oscSharedMemory_t *sm = (volatile oscSharedMemory_t *)sharedMemory;
    // Access the configuration structure using the pointer
    OscChannelConfig* channelConfig = sm->config.channels; // <<<<< THIS IS THE KEY LINE

