terranblake/Esp32_oscilloscope/servers/oscilloscope.h
    // Access global config via sm->config
    int samplingTime = sm->config.samplingTime;
    unsigned long screenWidthTime = sm->config.screenWidthTime;
    // bool oneSampleAtATime = sm->config.oneSampleAtATime; // TODO: Decide if this mode is needed

    // Access buffers via sm
    volatile oscSamples *readBuffer = &sm->readBuffer;
    volatile oscSamples *sendBuffer = &sm->sendBuffer;

    // <<< START REPLACEMENT BLOCK FOR SAMPLING TIME CORRECTION >>>
    // Recalculate samplingTime based on buffer size if needed
    unsigned long requiredSamples = (screenWidthTime + samplingTime - 1) / samplingTime; // Ceiling division
    #define MAX_OSC_SAMPLES_PER_PACKET (sizeof(readBuffer->samplesMultiChannel) / sizeof(readBuffer->samplesMultiChannel[0])) // Define locally if not global (safer)
    if (requiredSamples > MAX_OSC_SAMPLES_PER_PACKET - 1) { // -1 for config message
        samplingTime = (screenWidthTime + (MAX_OSC_SAMPLES_PER_PACKET - 2)) / (MAX_OSC_SAMPLES_PER_PACKET - 1); // Adjust sampling time to fit buffer
        samplingTime = max(samplingTime, 1); // Ensure sampling time is at least 1 us
        char dbg_msg[200];
        snprintf(dbg_msg, sizeof(dbg_msg), "oscReader_digital: samplingTime corrected to %d us to fit buffer (%d samples)", samplingTime, MAX_OSC_SAMPLES_PER_PACKET);
        __oscilloscope_h_debug__(dbg_msg);
        // Adjust screenWidthTime based on the corrected samplingTime to ensure it aligns with buffer capacity
        screenWidthTime = (unsigned long)samplingTime * (MAX_OSC_SAMPLES_PER_PACKET - 1);
    }

    // Is samplingTime is too long for delta_time (int16_t)?
    if (samplingTime > 32767) {
        samplingTime = 32767;
        __oscilloscope_h_debug__ ("oscReader_digital: samplingTime capped to 32767 us to fit in int16_t delta_time");
        // Adjust screenWidthTime based on the capped samplingTime
        screenWidthTime = (unsigned long)samplingTime * (MAX_OSC_SAMPLES_PER_PACKET - 1);
    }
    // <<< END REPLACEMENT BLOCK FOR SAMPLING TIME CORRECTION >>>

    // <<< START REPLACEMENT BLOCK FOR DEBUG OUTPUT >>>
    /**/
    cout << "----- oscReader_digital () -----\\r\\n"; // Use double backslash
    cout << "samplingTime " << samplingTime << " us" << endl;
    cout << "activeDigitalChannelCount " << sm->config.activeDigitalChannelCount << endl;
    cout << "Indices: ";
    for(int i=0; i<sm->config.activeDigitalChannelCount; ++i) cout << sm->config.activeDigitalChannelIndices[i] << " ";
    cout << endl;
    // Removed references to old trigger/signal vars
    cout << "screenWidthTime " << screenWidthTime << " us" << endl;
    cout << "max number of sampels " << MAX_OSC_SAMPLES_PER_PACKET << endl;
    cout << "max possible screenWidthTime covered by sampels " << (unsigned long)samplingTime * (MAX_OSC_SAMPLES_PER_PACKET - 1) << endl;
    delay (100);
    /**/
    // <<< END REPLACEMENT BLOCK FOR DEBUG OUTPUT >>>

    // Calculate screen refresh period.
    // This block seems okay, but ensure __oscilloscope_h_debug__ formatting is correct.
    unsigned long screenRefreshMilliseconds; // screen refresh period
    unsigned long correctedScreenWidthTime = screenWidthTime; // Use the corrected screenWidthTime from previous step
    screenRefreshMilliseconds = correctedScreenWidthTime >= 50000 ? correctedScreenWidthTime / 1000 : max(50UL, ((50500 / correctedScreenWidthTime) * correctedScreenWidthTime) / 1000);
    char dbg_msg_timing[200];
    snprintf(dbg_msg_timing, sizeof(dbg_msg_timing), "oscReader_digital: final samplingTime = %d us, screenWidthTime = %lu us, screenRefreshMs = %lu", samplingTime, screenWidthTime, screenRefreshMilliseconds);
    __oscilloscope_h_debug__(dbg_msg_timing);

    readBuffer->samplesAreReady = true; // this information will be always copied to sendBuffer together with the samples

    // <<< START REPLACEMENT BLOCK FOR GPIO SETUP >>>
    // Enable GPIO reading for active digital channels using indices
    for (int i = 0; i < sm->config.activeDigitalChannelCount; ++i) {
        int channelIndex = sm->config.activeDigitalChannelIndices[i]; // Get the actual channel index
        gpio_num_t gpio = channelConfig[channelIndex].gpio;
        if (gpio_is_valid_gpio(gpio)) { // Use IDF validation function
             gpio_set_direction(gpio, GPIO_MODE_INPUT);
             // Optionally set pull mode, e.g., pull-down if expecting high signals
             // gpio_set_pull_mode(gpio, GPIO_PULLDOWN_ONLY);
             char setup_msg[100];
             snprintf(setup_msg, sizeof(setup_msg), "Digital Reader: Configured GPIO %d for input (Channel Index %d)", (int)gpio, channelIndex);
             __oscilloscope_h_debug__(setup_msg);
        } else {
            char err_msg[100];
            snprintf(err_msg, sizeof(err_msg), "Digital Reader: Invalid GPIO %d for channel index %d", (int)gpio, channelIndex);
            __oscilloscope_h_debug__(err_msg);
            // Consider stopping the task or marking the channel as unusable
        }
    }
    // <<< END REPLACEMENT BLOCK FOR GPIO SETUP >>>

    // wait for the START signal
    while (sm->oscReaderState != START) delay (1);
    sm->oscReaderState = STARTED;
    __oscilloscope_h_debug__("Digital Reader: Started"); // Add debug after state change

    // --- do the sampling, samplingTime and screenWidthTime are in us ---

    // TODO: Re-implement Trigger logic based on channelConfig[trigger_channel_index]
    bool triggeredMode = false; // Disable trigger for now
    // Example Trigger config access (assuming trigger on channel 0):
    // int triggerChannelIndex = 0; // Need to determine which channel triggers
    // if (triggerChannelIndex >= 0 && triggerChannelIndex < MAX_OSC_CHANNELS && channelConfig[triggerChannelIndex].is_active) {
    //     triggeredMode = channelConfig[triggerChannelIndex].posTriggerEnabled || channelConfig[triggerChannelIndex].negTriggerEnabled;
    // }

    TickType_t lastScreenRefreshTicks = xTaskGetTickCount();

    while (sm->oscReaderState == STARTED) { // Main sampling loop (one loop per screen)

        unsigned long screenTime = 0;
        unsigned long deltaTime = 0;
        unsigned long lastSampleMicroseconds = micros();
        unsigned long newSampleMicroseconds = lastSampleMicroseconds;

        // <<< START REPLACEMENT BLOCK FOR DUMMY/CONFIG MESSAGE >>>
        readBuffer->sampleCount = 0; // Reset buffer count for new screen
        uint8_t active_channel_mask = 0;
        uint8_t analog_type_mask = 0; // Always 0 for digital reader
        for (int i = 0; i < sm->config.activeDigitalChannelCount; ++i) {
             int channelIndex = sm->config.activeDigitalChannelIndices[i]; // Use index from array
             active_channel_mask |= (1 << channelIndex); // Use actual channel index for mask
        }
        // Populate the first sample slot with config info
        readBuffer->samplesMultiChannel[0].delta_time = -1; // Indicate config message
        readBuffer->samplesMultiChannel[0].num_channels = active_channel_mask; // Store active channel mask
        readBuffer->samplesMultiChannel[0].values[0] = (int16_t)analog_type_mask; // Store type mask (all 0)
        for (int k = 1; k < MAX_OSC_CHANNELS; ++k) { // Clear remaining values in this sample slot
            readBuffer->samplesMultiChannel[0].values[k] = 0;
        }
        readBuffer->sampleCount = 1; // Config message is the first sample
        // <<< END REPLACEMENT BLOCK FOR DUMMY/CONFIG MESSAGE >>>

