terranblake/Esp32_oscilloscope/servers/oscilloscope.h
        // TODO: Re-implement Trigger wait logic if triggeredMode is true
        if (triggeredMode) {
             __oscilloscope_h_debug__("Digital Reader: Triggered mode entered - Wait logic TBD");
             // Placeholder: Wait and reset timing
             delay(100);
             lastSampleMicroseconds = micros();
             deltaTime = 0;
        }

        // --- Start inner sampling loop for one screen ---
        while (sm->oscReaderState == STARTED) { // Inner loop

            // <<< START REPLACEMENT OF INNER LOOP CORE >>>

            // Check if buffer is full OR screen time met
            if (readBuffer->sampleCount >= MAX_OSC_SAMPLES_PER_PACKET || screenTime >= screenWidthTime) {
                if (!sendBuffer->samplesAreReady) {
                    // Copy completed read buffer to send buffer
                    memcpy((void*)sendBuffer, (void*)readBuffer, sizeof(oscSamples));
                    sendBuffer->samplesAreReady = true; // Mark send buffer ready AFTER copy
                    // __oscilloscope_h_debug__("Digital Reader: Copied buffer to sender");
                } else {
                    // Send buffer is still busy from previous frame, skip this one
                     __oscilloscope_h_debug__("Digital Reader: Send buffer busy, skipping frame.");
                }
                goto next_screen; // Exit inner loop to start next screen/wait for refresh
            }

            // --- Take the next multi-channel sample ---
            int currentSampleIndex = readBuffer->sampleCount;
            readBuffer->samplesMultiChannel[currentSampleIndex].delta_time = (int16_t)deltaTime; // Store delta from *previous* sample

            uint8_t current_active_mask = 0; // Mask for channels actually read in *this* sample
             for (int i = 0; i < sm->config.activeDigitalChannelCount; ++i) {
                 int channelIndex = sm->config.activeDigitalChannelIndices[i]; // Use index from array
                 gpio_num_t gpio = channelConfig[channelIndex].gpio;
                 if (gpio_is_valid_gpio(gpio)) {
                    // Use IDF function for reading GPIO level
                    readBuffer->samplesMultiChannel[currentSampleIndex].values[channelIndex] = (int16_t)gpio_get_level(gpio);
                    current_active_mask |= (1 << channelIndex);
                 } else {
                     // GPIO became invalid? Or wasn't valid initially? Log/handle error?
                     readBuffer->samplesMultiChannel[currentSampleIndex].values[channelIndex] = 0; // Set to 0 if invalid
                 }
            }
            readBuffer->samplesMultiChannel[currentSampleIndex].num_channels = current_active_mask; // Store mask for this sample
            readBuffer->sampleCount++;
            // --- End multi-channel sample ---

            screenTime += deltaTime; // Accumulate screen time based on delta from previous sample

            // --- Wait until time for the *next* sample & calculate its delta ---
            newSampleMicroseconds = micros();
            // Busy-wait loop for precise timing
            while ((unsigned long)(newSampleMicroseconds - lastSampleMicroseconds) < (unsigned long)samplingTime) {
                 newSampleMicroseconds = micros();
                 // Consider taskYIELD() only if samplingTime is very large (e.g., > 1ms) to avoid hogging CPU
                 // otherwise, the busy-wait is more accurate for microsecond intervals.
            }
            deltaTime = newSampleMicroseconds - lastSampleMicroseconds; // Calculate delta for the sample just taken
            // Prevent deltaTime overflow if it exceeds int16_t max (can happen with scheduler delays)
            if (deltaTime > 32767) {
                 __oscilloscope_h_debug__("Digital Reader: Warning - deltaTime overflow, capping.");
                 deltaTime = 32767;
             }
            lastSampleMicroseconds = newSampleMicroseconds; // Update time for next iteration
            // --- End wait ---

            // <<< END REPLACEMENT OF INNER LOOP CORE >>>

        } // End inner sampling loop

    next_screen: // Label for goto statement
        // Wait before starting next screen acquisition (rate limiting)
        if (sm->oscReaderState == STARTED) {
             vTaskDelayUntil(&lastScreenRefreshTicks, pdMS_TO_TICKS(screenRefreshMilliseconds));
        }

    } // End outer sampling loop (while state is STARTED)

    // <<< START REPLACEMENT OF CLEANUP BLOCK >>>
    // --- Cleanup --- 
    __oscilloscope_h_debug__("Digital Reader: Exited main loop, stopping.");
    // Signal that reader is stopping/stopped and wait for external STOP signal confirmation if needed
    // (Current logic relies on external signal setting state to STOP first)
    while (sm->oscReaderState != STOP) {
        // This loop might not be strictly necessary if runOscilloscope waits for STOPPED after signaling STOP.
        // However, it ensures the reader doesn't exit prematurely if STOP signal is delayed.
        delay(1);
    }

    // Optional: Cleanup GPIOs (Reset to default state if necessary)
    // for (int i = 0; i < sm->config.activeDigitalChannelCount; ++i) {
    //     int channelIndex = sm->config.activeDigitalChannelIndices[i];
    //     gpio_num_t gpio = channelConfig[channelIndex].gpio;
    //     if (gpio_is_valid_gpio(gpio)) {
    //         gpio_reset_pin(gpio);
    //     }
    // }

    sm->oscReaderState = STOPPED; // Confirm stopped state
    __oscilloscope_h_debug__("Digital Reader: Set state to STOPPED.");
    vTaskDelete(NULL); // Delete this task
    // <<< END REPLACEMENT OF CLEANUP BLOCK >>>
}

    // oscReader that takes analog samples (analogRead) on time interval specified in microseconds
    //  - it can only read 1 or 2 digital signals
    //  - it can only work in 'screen at a time' mode (which is not a drawback for the sampling is measured in microseconds)
    void oscReader_analog (void *sharedMemory) {
        // <<< START REPLACEMENT BLOCK >>>
        volatile oscSharedMemory_t *sm = (volatile oscSharedMemory_t *)sharedMemory;
        OscChannelConfig* channelConfig = sm->config.channels;

