terranblake/Esp32_oscilloscope/servers/oscilloscope.h
        // Access global config via sm->config
        int samplingTime = sm->config.samplingTime; // Assuming us unit for analog
        unsigned long screenWidthTime = sm->config.screenWidthTime; // Assuming us unit

        // Access buffers via sm
        volatile oscSamples *readBuffer = &sm->readBuffer;
        volatile oscSamples *sendBuffer = &sm->sendBuffer;

        // ADC handle should be initialized in runOscilloscope and stored in sm->config
        // Retrieve it here for use in this reader task.
        adc_oneshot_unit_handle_t adc_handle = sm->config.adc_handle;
        if (!adc_handle) {
             __oscilloscope_h_debug__("Analog Reader Error: ADC handle is NULL!");
             // Handle error - perhaps stop the task?
             sm->oscReaderState = STOPPED; // Indicate failure
             vTaskDelete(NULL);
             return; // Should not be reached, but good practice
        }
        // <<< END REPLACEMENT BLOCK >>>

        // Is samplingTime large enough to fill the whole screen? If not, make a correction.
        // Needs update for multi-channel
        /* OLD LOGIC:
        if (noOfSignals == 1) {
            if ((unsigned long) samplingTime * (OSCILLOSCOPE_1SIGNAL_BUFFER_SIZE - 2) < screenWidthTime) {
                samplingTime = max ((int) (screenWidthTime / (OSCILLOSCOPE_1SIGNAL_BUFFER_SIZE - 2)) + 1, 1); // + 1 just to be on the safe side due to integer calculation rounding
                __oscilloscope_h_debug__ ("oscReader_analog: 1 signal samplingTime was too short (regarding to buffer size) and is corrected to " + String (samplingTime));
            }
        } else {
            if ((unsigned long) samplingTime * (OSCILLOSCOPE_2SIGNALS_BUFFER_SIZE - 2) < screenWidthTime) {
                samplingTime = max ((int) (screenWidthTime / (OSCILLOSCOPE_2SIGNALS_BUFFER_SIZE - 2)) + 1, 1); // + 1 just to be on the safe side due to integer calculation rounding
                __oscilloscope_h_debug__ ("oscReader_analog: 2 signals samplingTime was too short (regarding to buffer size) and is corrected to " + String (samplingTime));
            }
        }
        */
        // ... rest of function ...

        // Is samplingTime is too long for 15 bits? Make a correction. Max sample time can be 32767 (15 bits) but since in some case actual sample time can be much larger than required let's keep it below 5000.
        if (samplingTime > 5000) {
                samplingTime = 5000;
                // __oscilloscope_h_debug__ ("oscReader_analog: samplingTime was too long (to fit in 15 bits in (almost?) all cases) and is corrected to " + String (samplingTime));
                cout << "oscReader_analog: samplingTime was too long (to fit in 15 bits in (almost?) all cases) and is corrected to " << samplingTime;
        }

        /**/
        cout << "----- oscReader_analog () -----\\r\\n"; // Double backslash
        cout << "samplingTime " << samplingTime << " us" << endl;
        cout << "activeAnalogChannelCount " << sm->config.activeAnalogChannelCount << endl;
        cout << "Indices: ";
        for(int i=0; i<sm->config.activeAnalogChannelCount; ++i) cout << sm->config.activeAnalogChannelIndices[i] << " ";
        cout << endl;
        // Removed references to old trigger/signal vars
        cout << "screenWidthTime " << screenWidthTime << " us" << endl;
        cout << "max number of sampels " << MAX_OSC_SAMPLES_PER_PACKET << endl;
        cout << "max possible screenWidthTime covered by sampels " << (unsigned long)samplingTime * (MAX_OSC_SAMPLES_PER_PACKET - 1) << endl;
        delay (100);
        /**/

        // Calculate screen refresh period. It sholud be arround 50 ms (sustainable screen refresh rate is arround 20 Hz) but it is better if it is a multiple value of screenWidthTime.
        unsigned long screenRefreshMilliseconds; // screen refresh period
        int noOfSamplesPerScreen = screenWidthTime / samplingTime; if (noOfSamplesPerScreen * samplingTime < screenWidthTime) noOfSamplesPerScreen ++;
        unsigned long correctedScreenWidthTime = noOfSamplesPerScreen * samplingTime;                         
        screenRefreshMilliseconds = correctedScreenWidthTime >= 50000 ? correctedScreenWidthTime / 1000 : ((50500 / correctedScreenWidthTime) * correctedScreenWidthTime) / 1000;
        __oscilloscope_h_debug__ ("oscReader_analog: samplingTime = " + String (samplingTime) + ", screenWidthTime = " + String (screenWidthTime));

        readBuffer->samplesAreReady = true; // this information will be always copied to sendBuffer together with the samples

        // wait for the START signal
        while (sm->oscReaderState != START) delay (1);
        sm->oscReaderState = STARTED;
        __oscilloscope_h_debug__("Analog Reader: Started");

        // Remove old capabilities check (Multi-channel check is more complex)
        /* OLD CODE:
        if (noOfSignals == 2 && screenWidthTime <= 200 || noOfSignals == 1 && screenWidthTime <= 100) {
            #ifdef __DMESG__
                dmesgQueue << "[oscilloscope] the settings exceed oscilloscope capabilities.";
            #endif
            sm->webSocket->sendString ("[oscilloscope] the settings exceed oscilloscope capabilities."); // send error to javascript client
            sm->webSocket->closeWebSocket ();
            while (sm->oscReaderState != STOP) delay (1);
            sm->oscReaderState = STOPPED;
            vTaskDelete (NULL);
        }
        */

        // --- do the sampling, samplingTime and screenWidthTime are in us ---
        // ... rest of function ...

        // triggered or untriggered mode of operation
        bool triggeredMode = positiveTrigger || negativeTrigger;

        TickType_t lastScreenRefreshTicks = xTaskGetTickCount ();               // for timing screen refresh intervals            

        while (sm->oscReaderState == STARTED) { // sampling from the left of the screen - while not getting STOP signal

            unsigned long screenTime = 0;                                       // in us - how far we have already got from the left of the screen (we'll compare this value with screenWidthTime)
            unsigned long deltaTime = 0;                                        // in us - delta from previous sample
            unsigned long lastSampleMicroseconds = micros ();                   // for sample timing                
            unsigned long newSampleMicroseconds = lastSampleMicroseconds;

            // --- Generate Multi-Channel Dummy/Config Message --- 
            uint8_t active_channel_mask = 0;
            uint8_t analog_type_mask = 0;
            for (int i = 0; i < MAX_OSC_CHANNELS; ++i) {
                if (channelConfig[i].is_active) { // Assumes only analog channels are active in this reader
                    active_channel_mask |= (1 << i);
                    if (channelConfig[i].is_analog) {
                         analog_type_mask |= (1 << i); // Mark as analog
                    } // Else: digital (should not happen if analog mode forced)
                }
            }
            readBuffer->samplesMultiChannel[0].delta_time = -1; // Indicate config message
            readBuffer->samplesMultiChannel[0].num_channels = active_channel_mask; // Store active channel mask here
            readBuffer->samplesMultiChannel[0].values[0] = (int16_t)analog_type_mask; // Store type mask in values[0]
            // Clear remaining values in dummy message for clarity
            for (int k = 1; k < MAX_OSC_CHANNELS; ++k) { 
                readBuffer->samplesMultiChannel[0].values[k] = 0;
            }
            readBuffer->sampleCount = 1;
            // --- End Dummy Message Generation ---

            /* --- REMOVED old placeholder/TODO for dummy message ---
            // TODO: Define and insert the correct multi-channel dummy message.
            // This message needs to convey the number and type (A/D) of active channels.
            // For now, using a placeholder. The client JS needs updating to parse this.
            readBuffer->samplesMultiChannel[0].num_channels = numActiveAnalog; // Example placeholder
            readBuffer->samplesMultiChannel[0].delta_time = -1; // Indicate dummy message
            for(int k=0; k<numActiveAnalog; ++k) readBuffer->samplesMultiChannel[0].values[k] = -1; // Placeholder values
            readBuffer->sampleCount = 1;
            */


