terranblake/Esp32_oscilloscope/servers/oscilloscope.h
        } // while sampling

        // wait for the STOP signal
        while (sm->oscReaderState != STOP) delay (1);
        sm->oscReaderState = STOPPED; 

        vTaskDelete (NULL);
    }


    #ifdef USE_I2S_INTERFACE
        void oscReader_analog_1_signal_i2s (void *sharedMemory) {
            // *not needed* bool doAnalogRead =                 !strcmp (((oscSharedMemory *) sharedMemory)->readType, "analog");
            // *not needed* bool unitIsMicroSeconds =           !strcmp (((oscSharedMemory *) sharedMemory)->samplingTimeUnit, "us");
            int samplingTime =                  ((oscSharedMemory *) sharedMemory)->samplingTime;
            bool positiveTrigger =              ((oscSharedMemory *) sharedMemory)->positiveTrigger;
            bool negativeTrigger =              ((oscSharedMemory *) sharedMemory)->negativeTrigger;
            unsigned char gpio1 =               (unsigned char) ((oscSharedMemory *) sharedMemory)->gpio1; // easier to check validity with unsigned char then with integer 
            // * not needed * unsigned char gpio2 =               (unsigned char) ((oscSharedMemory *) sharedMemory)->gpio2; // easier to check validity with unsigned char then with integer
            // * not needed * unsigned char noOfSignals = 1; if (gpio2 <= 39) noOfSignals = 2;  // monitor 1 or 2 signals
            adc1_channel_t adcchannel1 =        ((oscSharedMemory *) sharedMemory)->adcchannel1;
            // * not needed * adc1_channel_t adcchannel2 =        ((oscSharedMemory *) sharedMemory)->adcchannel2;
            int positiveTriggerTreshold =       ((oscSharedMemory *) sharedMemory)->positiveTriggerTreshold;
            int negativeTriggerTreshold =       ((oscSharedMemory *) sharedMemory)->negativeTriggerTreshold;
            unsigned long screenWidthTime =     ((oscSharedMemory *) sharedMemory)->screenWidthTime; 
            oscSamples *readBuffer =            &((oscSharedMemory *) sharedMemory)->readBuffer;
            oscSamples *sendBuffer =            &((oscSharedMemory *) sharedMemory)->sendBuffer;

            // How many samples do we need to take? The following should be considered:
            // (A) - at leastsampleRate * screenWidthTime / 1000000 + 1; (1 sample more than distance between them)
            // (B) - it must be an even number, otherwise the last sample taken would be 0
            // (C) - it must be at most OSCILLOSCOPE_I2S_BUFFER_SIZE - 1 (the 0-th sample in the buffer is reserved for "dummy" value)
            // (D) - it must be at least 8 due to i2s_read limitations, if working in triggered mode we have to consider that at least 8 samples must be read (at second reading) for the rest of teh signal
            // (E) - the first is2_read after the initialisation often contains false readings (all 16 bits are 0) at the beginning (normally at the first 6 samples read), let's always delete the first 8 samples read just to be on the safe side which wil also solve the problem (D)

            cout << "----- oscReader_I2S () before correction -----\\r\\n";
            cout << "samplingTime " << samplingTime << " us" << endl;

            // calculate correct sampling time so that it will prefectly aligh with sampleRate (regarding integer calculation rounding) and that the sample buffer is large enough 
            unsigned long sampleRate = 1000000 / samplingTime; // samplingTime is in us
            int noOfSamplesToTakeFirstTime = sampleRate * screenWidthTime / 1000000 + 1 + 8; // screenWidhtTime is in us, 1 sample more than the distancesbetween them (A) (E)
            while (samplingTime != 1000000 / sampleRate // integer clculation rounding missmatch
              || (unsigned long) samplingTime * (OSCILLOSCOPE_I2S_BUFFER_SIZE - 1 - 1) < screenWidthTime // samples do not fill the screen (additional - 1 due to possible (B))
              || noOfSamplesToTakeFirstTime > (OSCILLOSCOPE_I2S_BUFFER_SIZE - 1 - 1) // samples do not fit in the buffer (the first sample is dummy sample, additional - 1 due to (B))
              || samplingTime < 4 // dummy values -2 and -3 are already taken for different types of buffer
              || samplingTime < 7) // max ESP32 sampling rate = 150 kHz (sampling time >= 6.6 us)
            {
                samplingTime ++;
                sampleRate = 1000000 / samplingTime;
                noOfSamplesToTakeFirstTime = sampleRate * screenWidthTime / 1000000 + 1 + 8; // (A) (E)
            }
            if (noOfSamplesToTakeFirstTime % 2 != 0) noOfSamplesToTakeFirstTime ++; // (B)
            if (noOfSamplesToTakeFirstTime <= 8) noOfSamplesToTakeFirstTime = 10; // (D), add at least 2 usefull samples

            // Is samplingTime is too long for 15 bits, make a correction. Max sample time can be 32767 (15 bits) but since in some case actual sample time can be much larger than required le's keep it below 5000.
            if (samplingTime > 32767) {
                samplingTime = 32767;
                __oscilloscope_h_debug__ ("oscReader_analog_1_signal_i2s: oscReader_oscReader_analog_1_signal_i2s] sampling with these parameters will not be precise");
                #ifdef __DMESG__
                    dmesgQueue << "[oscilloscope][oscReader_oscReader_analog_1_signal_i2s] sampling with these parameters will not be precise";
                #endif
            }

            /**/
            cout << "----- oscReader_I2S () after correction -----\\r\\n";
            cout << "samplingTime " << samplingTime << " us" << endl;
            cout << "sample rate " << 1000000 / samplingTime << endl;
            cout << "positiveTrigger " << positiveTrigger << endl;
            cout << "negativeTrigger " << negativeTrigger << endl;
            cout << "gpio1 " << gpio1 << endl;
            // cout << "gpio2 " << gpio2 << endl;
            // cout << "noOfSignals " << noOfSignals << endl;
            cout << "positiveTriggerTreshold " << positiveTriggerTreshold << endl;
            cout << "negativeTriggerTreshold " << negativeTriggerTreshold << endl;
            cout << "screenWidthTime " << screenWidthTime << endl;
            cout << "max number of sampels " << OSCILLOSCOPE_I2S_BUFFER_SIZE << endl;
            cout << "max possible screenWidthTime covered by sampels " << samplingTime * OSCILLOSCOPE_I2S_BUFFER_SIZE << endl;
            delay (100);
            /**/

            // Calculate screen refresh period. It sholud be arround 50 ms (sustainable screen refresh rate is arround 20 Hz) but it is better if it is a multiple value of screenWidthTime.
            unsigned long screenRefreshMilliseconds; // screen refresh period
            int noOfSamplesPerScreen = screenWidthTime / samplingTime; if (noOfSamplesPerScreen * samplingTime < screenWidthTime) noOfSamplesPerScreen ++;
            unsigned long correctedScreenWidthTime = noOfSamplesPerScreen * samplingTime;                         
            screenRefreshMilliseconds = correctedScreenWidthTime >= 50000 ? correctedScreenWidthTime / 1000 : ((50500 / correctedScreenWidthTime) * correctedScreenWidthTime) / 1000;
            __oscilloscope_h_debug__ ("oscReader_analog_1_signal_i2s: samplingTime = " + String (samplingTime) + ", screenWidthTime = " + String (screenWidthTime));
            __oscilloscope_h_debug__ ("oscReader_analog_1_signal_i2s: sampleRate = " + String (sampleRate) + ", noOfSamplesToTake = " + String (noOfSamplesToTakeFirstTime));
            __oscilloscope_h_debug__ ("oscReader_analog_1_signal_i2s: screenRefreshMilliseconds = " + String (screenRefreshMilliseconds) + " ms (should be close to 50 ms), screen refresh frequency = " + String (1000.0 / screenRefreshMilliseconds) + " Hz (should be close to 20 Hz)");

            readBuffer->samplesAreReady = true; // this information will be always copied to sendBuffer together with the samples

            // wait for the START signal
            while (sm->oscReaderState != START) delay (1);
            sm->oscReaderState = STARTED;
            __oscilloscope_h_debug__("Analog Reader: Started");

            // Remove old capabilities check (Multi-channel check is more complex)
            /* OLD CODE:
            if (noOfSignals == 2 && screenWidthTime <= 200 || noOfSignals == 1 && screenWidthTime <= 100) {
                #ifdef __DMESG__
                    dmesgQueue << "[oscilloscope] the settings exceed oscilloscope capabilities.";
                #endif
                sm->webSocket->sendString ("[oscilloscope] the settings exceed oscilloscope capabilities."); // send error to javascript client
                sm->webSocket->closeWebSocket ();
                while (sm->oscReaderState != STOP) delay (1);
                sm->oscReaderState = STOPPED;
                vTaskDelete (NULL);
            }
            */

            // --- do the sampling, samplingTime and screenWidthTime are in us ---
            // ... rest of function ...

            // triggered or untriggered mode of operation
            bool triggeredMode = positiveTrigger || negativeTrigger;
            int noOfSamplesTaken;

            TickType_t lastScreenRefreshTicks = xTaskGetTickCount ();               // for timing screen refresh intervals            

