terranblake/Esp32_oscilloscope/servers/oscilloscope.h
            while (sm->oscReaderState == STARTED) { // sampling from the left of the screen - while not getting STOP signal

                // Insert first dummy sample to read-buffer this tells javascript client to start drawing from the left of the screen. Please note that it also tells javascript client how many signals are in each sample
                readBuffer->samplesI2sSignal [0].signal1 = -samplingTime; // no real data sample can look like this
                // readBuffer->sampleCount = 1;
                // take (the rest of the) samples that fit on one screen: https://www.instructables.com/The-Best-Way-for-Sampling-Audio-With-ESP32

                // setupI2S
                esp_err_t err;
                i2s_config_t i2s_config = { 
                    .mode = (i2s_mode_t) (I2S_MODE_MASTER | I2S_MODE_RX | I2S_MODE_ADC_BUILT_IN),
                    .sample_rate = (uint32_t) ((1000000 / samplingTime) * I2S_FREQ_CORRECTION), // = samplingFrequency (samplingTime is in us),
                    .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT, // could only get it to work with 32bits
                    .channel_format = I2S_CHANNEL_FMT_ONLY_LEFT, // <- mono signal - stereo signal -> I2S_CHANNEL_FMT_RIGHT_LEFT, // although the SEL config should be left, it seems to transmit on right
                    .communication_format = i2s_comm_format_t (I2S_COMM_FORMAT_STAND_I2S), //// I2S_COMM_FORMAT_STAND_I2S, // I2S_COMM_FORMAT_I2S_MSB, - deprecated
                    .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1, // Interrupt level 1
                    .dma_buf_count = 4, // number of buffers
                    .dma_buf_len = noOfSamplesToTakeFirstTime, // samples per buffer
                    .use_apll = true // false//,
                    // .tx_desc_auto_clear = false,
                    // .fixed_mclk = 1
                };
              
                err = i2s_driver_install (I2S_NUM_0, &i2s_config,  0, NULL);  //step 2

                if (err != ESP_OK) {
                    Serial.printf ("Failed installing driver: %d\n", err);
                    #ifdef __DMESG__
                        dmesgQueue << "[oscilloscope][oscReader_oscReader_analog_1_signal_i2s] failed to install the driver: " << err;
                    #endif

                    sm->webSocket->sendString ("[oscilloscope] failed to install the i2s driver."); // send error to javascript client
                    sm->webSocket->closeWebSocket ();
                    // wait for the STOP signal
                    while (sm->oscReaderState != STOP) delay (1);
                    sm->oscReaderState = STOPPED;
                    vTaskDelete (NULL);
                }

                err = i2s_set_adc_mode (ADC_UNIT_1, adcchannel1);
                if (err != ESP_OK) {
                    Serial.printf ("Failed setting up adc mode: %d\n", err);
                    #ifdef __DMESG__
                        dmesgQueue << "[oscilloscope][oscReader_oscReader_analog_1_signal_i2s] failed setting up adc mode: " << err;
                    #endif
                    i2s_driver_uninstall (I2S_NUM_0);

                    sm->webSocket->sendString ("[oscilloscope] failed setting up i2s adc mode."); // send error to javascript client
                    sm->webSocket->closeWebSocket ();
                    // wait for the STOP signal
                    while (sm->oscReaderState != STOP) delay (1);
                    sm->oscReaderState = STOPPED;                
                    vTaskDelete (NULL);
                }

                while (sm->oscReaderState == STARTED) {

                    // read the whole buffer
                    size_t bytesRead = 0;
                    err = i2s_read (I2S_NUM_0, 
                                    (void *) &readBuffer->samplesI2sSignal [1], // skip the first (dummy) sample
                                    noOfSamplesToTakeFirstTime << 1, // in bytes
                                    &bytesRead,
                                    pdMS_TO_TICKS (1000)); // portMAX_DELAY); // no timeout
                    noOfSamplesTaken = bytesRead >> 1; // samples are 16 bit integers 
                    if (err != ESP_OK || noOfSamplesTaken < 10) { // we'll leave first 8 samples out so if we don't have even 2 usable samples there id probably something wrong
                        Serial.printf ("Failed reading the samples: %d\n", err);
                        #ifdef __DMESG__
                            dmesgQueue << "[oscilloscope][oscReader_oscReader_analog_1_signal_i2s] failed reading  the samples: " << err;
                        #endif
                        i2s_driver_uninstall (I2S_NUM_0);

                        sm->webSocket->sendString ("[oscilloscope] failed reading the samples."); // send error to javascript client
                        sm->webSocket->closeWebSocket ();
                        // wait for the STOP signal
                        while (sm->oscReaderState != STOP) delay (1);
                        sm->oscReaderState = STOPPED;                    
                        vTaskDelete (NULL);
                    }

                    // For some strange reason the sample come swapped two-by two. Unswap them and filter out only 12 bits that actually hold the value while also skipping the first 8 samples
                    noOfSamplesTaken -= 8;
                    #ifdef INVERT_I2S_READ
                        for (int i = 1; i <= noOfSamplesTaken; i += 2) {
                            readBuffer->samplesI2sSignal [i].signal1 = ~readBuffer->samplesI2sSignal [i + 9].signal1 & 0xFFF;
                            readBuffer->samplesI2sSignal [i + 1].signal1 = ~readBuffer->samplesI2sSignal [i + 8].signal1 & 0xFFF;
                        }
                    #else
                        for (int i = 1; i <= noOfSamplesTaken; i += 2) {
                            readBuffer->samplesI2sSignal [i].signal1 = readBuffer->samplesI2sSignal [i + 9].signal1 & 0xFFF;
                            readBuffer->samplesI2sSignal [i + 1].signal1 = readBuffer->samplesI2sSignal [i + 8].signal1 & 0xFFF;
                        }
                    #endif

                    if (!triggeredMode) break; // if not in triggered modt then we already have what we need

                    // if in triggered mode try to find trigger condition
                    for (int i = 1; i < noOfSamplesTaken; i++) {
                        if ( (positiveTrigger && readBuffer->samplesI2sSignal [i].signal1 < positiveTriggerTreshold && readBuffer->samplesI2sSignal [i + 1].signal1 >= positiveTriggerTreshold) || (negativeTrigger && readBuffer->samplesI2sSignal [i].signal1 > negativeTriggerTreshold && readBuffer->samplesI2sSignal [i + 1].signal1 <= negativeTriggerTreshold) ) { 
                            // trigger condition found at i, copy the rest of the buffer to its beginning and do another i2s_read for the samples that are missing
                            if (i > 1) {
                                int noOfSamplesToTakeSecondTime = (i - 1);
                                // there is a bug in i2s_read: it odd number of samples are to be read the last one is always 0, so make sure we have even number of samples
                                if (noOfSamplesToTakeSecondTime % 2 != 0) noOfSamplesToTakeSecondTime ++;
                                if (noOfSamplesToTakeSecondTime < 8) noOfSamplesToTakeSecondTime = 8;
                                int fromInd = noOfSamplesTaken - (i - 1) + 1;
                                __oscilloscope_h_debug__ ("oscReader_analog_1_signal_i2s: trigger condition found at " + String (i) + " need to read additional " + String (need to read additional) + " samples at buffer position " + String (fromInd));
                                memcpy ((void*) &readBuffer->samplesI2sSignal [1], (void*) &readBuffer->samplesI2sSignal [i], (noOfSamplesTaken - (i - 1)) << 1);
                                err = i2s_read (I2S_NUM_0, 
                                                (void*) &readBuffer->samplesI2sSignal [fromInd],
                                                noOfSamplesToTakeSecondTime << 1, // in bytes
                                                &bytesRead,
                                                pdMS_TO_TICKS (1000)); // portMAX_DELAY); // no timeout
                                if (err != ESP_OK || noOfSamplesTaken == 0) {
                                    Serial.printf ("Failed reading the samples: %d\n", err);
                                    #ifdef __DMESG__
                                        dmesgQueue << "[oscilloscope][oscReader_oscReader_analog_1_signal_i2s] failed reading the samples: " << err;
                                    #endif
                                    i2s_driver_uninstall (I2S_NUM_0);

                                    sm->webSocket->sendString ("[oscilloscope] failed reading the samples."); // send error to javascript client
                                    sm->webSocket->closeWebSocket ();
                                    // wait for the STOP signal
                                    while (sm->oscReaderState != STOP) delay (1);
                                    sm->oscReaderState = STOPPED;                                
                                    vTaskDelete (NULL);
                                }
                                noOfSamplesTaken = noOfSamplesTaken - (i - 1) + (bytesRead >> 1); // - deleted samples + newly read samples (normally we would end up with the same number)
                                // for (int j = fromInd; j <= noOfSamplesTaken; j++) readBuffer->samplesI2sSignal [j].signal1 &= 0x0FFF;
                                // For some strange reason the sample come swapped two-by two. Unswap them and filter out only 12 bits that actually hold the value
                                #ifdef INVERT_I2S_READ
                                    for (int j = fromInd; j < noOfSamplesTaken; j += 2) {
                                        int16_t tmp = readBuffer->samplesI2sSignal [j].signal1;
                                        readBuffer->samplesI2sSignal [j].signal1 = ~readBuffer->samplesI2sSignal [j + 1].signal1 & 0xFFF;
                                        readBuffer->samplesI2sSignal [j + 1].signal1 = ~tmp & 0x0FFF;
                                    }
                                #else
                                    for (int j = fromInd; j < noOfSamplesTaken; j += 2) {
                                        int16_t tmp = readBuffer->samplesI2sSignal [j].signal1;
                                        readBuffer->samplesI2sSignal [j].signal1 = readBuffer->samplesI2sSignal [j + 1].signal1 & 0xFFF;
                                        readBuffer->samplesI2sSignal [j + 1].signal1 = tmp & 0x0FFF;
                                    }
                                #endif
                            }

                            goto passSamplesToOscSender;
                        }
                    }
                    // trigger condition not found, continue reading
                } // while (true)

