terranblake/Esp32_oscilloscope/servers/oscilloscope.h
      if (sharedMemory.numActiveChannels == 0) {
           __oscilloscope_h_debug__("[oscilloscope] No active channels configured.");
           webSocket->sendString("[oscilloscope] No active channels configured.");
           return;
      }

      // --- Enforce Mode (Analog OR Digital, not mixed) ---
      if (anyAnalogActive && anyDigitalActive) {
          __oscilloscope_h_debug__("[oscilloscope] Mixed Analog/Digital channels requested. Defaulting to Analog mode.");
          anyDigitalActive = false;
          // Adjust config: deactivate digital channels if analog is present
          uint8_t actualActiveCount = 0;
          for(int i=0; i<MAX_OSC_CHANNELS; ++i) {
              if (sharedMemory.channelConfig[i].is_active) {
                   if (!sharedMemory.channelConfig[i].is_analog) {
                       sharedMemory.channelConfig[i].is_active = false;
                       __oscilloscope_h_debug__(("Deactivating digital channel " + String(i) + " due to mixed mode.").c_str());
                   } else {
                       actualActiveCount++;
                   }
              }
          }
          sharedMemory.numActiveChannels = actualActiveCount;
          if (sharedMemory.numActiveChannels == 0) {
              __oscilloscope_h_debug__("[oscilloscope] No active analog channels remaining after mixed mode filter.");
              webSocket->sendString("[oscilloscope] Mixed mode detected, no active analog channels found.");
              return;
          }
      }

      // --- Hardware Setup (Added in this step) ---
      esp_err_t setup_err = ESP_OK;

      // Configure ADC Unit and Channels if any analog channel is active
      if (anyAnalogActive) {
          __oscilloscope_h_debug__("Setting up ADC1 for Oneshot mode.");
          adc_oneshot_unit_init_cfg_t init_config1 = {
              .unit_id = ADC_UNIT_1
          };
          setup_err = adc_oneshot_new_unit(&init_config1, &adc1_handle);
          if (setup_err != ESP_OK) {
              char errorMsg[100];
              snprintf(errorMsg, sizeof(errorMsg), "[oscilloscope] Failed to initialize ADC1 unit: %s", esp_err_to_name(setup_err));
              __oscilloscope_h_debug__(errorMsg);
              webSocket->sendString(errorMsg);
              return;
          }

          adc_oneshot_chan_cfg_t config = {
              .atten = ADC_ATTEN_DB_11, // Use 11dB attenuation (~0-3.1V range on ESP32)
              .bitwidth = ADC_BITWIDTH_12
          };

          for (int i = 0; i < MAX_OSC_CHANNELS; ++i) {
              if (sharedMemory.channelConfig[i].is_active && sharedMemory.channelConfig[i].is_analog) {
                  setup_err = adc_oneshot_config_channel(adc1_handle, sharedMemory.channelConfig[i].adc_channel, &config);
                   if (setup_err != ESP_OK) {
                       char errorMsg[150];
                       snprintf(errorMsg, sizeof(errorMsg), "[oscilloscope] Failed to configure ADC1 channel %d (GPIO %d): %s",
                                (int)sharedMemory.channelConfig[i].adc_channel, (int)sharedMemory.channelConfig[i].gpio, esp_err_to_name(setup_err));
                       __oscilloscope_h_debug__(errorMsg);
                       webSocket->sendString(errorMsg);
                       adc_oneshot_del_unit(adc1_handle); // Clean up allocated unit
                       return;
                   }
                   sharedMemory.channelConfig[i].adc_handle = adc1_handle; // Store handle for the reader task
                   __oscilloscope_h_debug__(("Configured ADC1 Chan " + String(sharedMemory.channelConfig[i].adc_channel) + " for GPIO " + String(sharedMemory.channelConfig[i].gpio)).c_str());
              }
          }
      }

      // Configure GPIOs for Digital Inputs if any digital channel is active
      if (anyDigitalActive) {
          uint64_t digital_pin_mask = 0;
          for (int i = 0; i < MAX_OSC_CHANNELS; ++i) {
              if (sharedMemory.channelConfig[i].is_active && !sharedMemory.channelConfig[i].is_analog) {
                  // Ensure the GPIO is valid for digital input (most are, but good practice)
                  if (!GPIO_IS_VALID_GPIO(sharedMemory.channelConfig[i].gpio)) {
                        char errorMsg[100];
                        snprintf(errorMsg, sizeof(errorMsg), "[oscilloscope] Invalid GPIO %d for digital input on channel %d.", (int)sharedMemory.channelConfig[i].gpio, i);
                        __oscilloscope_h_debug__(errorMsg);
                        webSocket->sendString(errorMsg);
                        if(adc1_handle) adc_oneshot_del_unit(adc1_handle); // Clean up ADC if initialized
                        return;
                  }
                  digital_pin_mask |= (1ULL << sharedMemory.channelConfig[i].gpio);
                  __oscilloscope_h_debug__(("Queueing GPIO " + String(sharedMemory.channelConfig[i].gpio) + " for digital input config.").c_str());
              }
          }

          if (digital_pin_mask != 0) {
              __oscilloscope_h_debug__(("Configuring digital GPIO mask: " + String((unsigned long long)digital_pin_mask, HEX)).c_str());
              gpio_config_t io_conf = {};
              io_conf.pin_bit_mask = digital_pin_mask;
              io_conf.mode = GPIO_MODE_INPUT;
              io_conf.pull_up_en = GPIO_PULLUP_DISABLE;
              io_conf.pull_down_en = GPIO_PULLDOWN_ENABLE; // Often good to pull down digital inputs if floating
              io_conf.intr_type = GPIO_INTR_DISABLE;
              setup_err = gpio_config(&io_conf);
              if (setup_err != ESP_OK) {
                   char errorMsg[100];
                   snprintf(errorMsg, sizeof(errorMsg), "[oscilloscope] Failed to configure digital GPIOs: %s", esp_err_to_name(setup_err));
                   __oscilloscope_h_debug__(errorMsg);
                   webSocket->sendString(errorMsg);
                   if(adc1_handle) adc_oneshot_del_unit(adc1_handle); // Clean up ADC if initialized
                   return;
              }
               __oscilloscope_h_debug__("Digital GPIOs configured.");
          }
      }
      // --- End Hardware Setup ---


      // --- Task Selection, Start & Cleanup ---
      void (*oscReader)(void *sharedMemory) = NULL; // Function pointer for the chosen reader

      if (anyAnalogActive) {
          __oscilloscope_h_debug__("Selecting oscReader_analog.");
          oscReader = oscReader_analog;
          // Note: I2S reader (`oscReader_analog_1_signal_i2s`) is currently incompatible
          // with the multi-channel structure and ADC oneshot driver. It would need significant rework.
      } else if (anyDigitalActive) {
           __oscilloscope_h_debug__("Selecting oscReader_digital.");
          oscReader = oscReader_digital;
      } else {
          // This case should have been caught earlier (numActiveChannels == 0 or mixed mode with no analog)
          __oscilloscope_h_debug__("[oscilloscope] No active channels suitable for starting reader.");
          if(adc1_handle) adc_oneshot_del_unit(adc1_handle); // Cleanup ADC
          return;
      }

      // --- Start Tasks ---
      sharedMemory.oscReaderState = INITIAL; // Reset state before starting
      TaskHandle_t oscReaderHandle = NULL;   // Handle to manage the reader task

      #ifdef OSCILLOSCOPE_READER_CORE
          BaseType_t taskCreated = xTaskCreatePinnedToCore (oscReader, "oscReader", 8 * 1024, (void *) &sharedMemory, OSCILLOSCOPE_READER_PRIORITY, &oscReaderHandle, OSCILLOSCOPE_READER_CORE); // Increased stack size
      #else
          BaseType_t taskCreated = xTaskCreate (oscReader, "oscReader", 8 * 1024, (void *) &sharedMemory, OSCILLOSCOPE_READER_PRIORITY, &oscReaderHandle); // Increased stack size
      #endif

      if (pdPASS != taskCreated) {
           char errorMsg[100];
           snprintf(errorMsg, sizeof(errorMsg), "[oscilloscope] Failed to create oscReader task (Stack: 8k, Prio: %d)", OSCILLOSCOPE_READER_PRIORITY);
            __oscilloscope_h_debug__(errorMsg);
            webSocket->sendString(errorMsg);
            if(adc1_handle) adc_oneshot_del_unit(adc1_handle); // Cleanup ADC
      } else {
          __oscilloscope_h_debug__("oscReader task created.");
          // send oscReader START signal and wait until STARTED
          sharedMemory.oscReaderState = START;
          // Wait for reader to confirm start, with a timeout
          TickType_t startTime = xTaskGetTickCount();
          while (sharedMemory.oscReaderState == START && (xTaskGetTickCount() - startTime < pdMS_TO_TICKS(500))) { // 500ms timeout
              delay(1);
          }

          if (sharedMemory.oscReaderState == STARTED) {
               __oscilloscope_h_debug__("oscReader task confirmed started. Starting oscSender.");
              // start oscilloscope sender in this thread
              oscSender ((void *) &sharedMemory);
              // ---- Sender has exited ----
               __oscilloscope_h_debug__("oscSender task exited. Signaling oscReader to stop.");

