terranblake/Esp32_oscilloscope/servers/oscilloscope.h
              // Ensure reader is signaled to stop (sender might have already done this on error)
              if (sharedMemory.oscReaderState != STOPPED && sharedMemory.oscReaderState != STOP) {
                   sharedMemory.oscReaderState = STOP;
              }

              // Wait until oscReader confirms STOPPED or timeout
              startTime = xTaskGetTickCount();
              while (sharedMemory.oscReaderState != STOPPED && (xTaskGetTickCount() - startTime < pdMS_TO_TICKS(500))) { // 500ms timeout
                  delay(1);
              }
               if (sharedMemory.oscReaderState != STOPPED) {
                   __oscilloscope_h_debug__("Timed out waiting for oscReader to stop. Task may be stuck.");
                   // Deleting the task is risky if it holds resources.
                   if (oscReaderHandle) { 
                       // vTaskDelete(oscReaderHandle); // Uncomment if needed, but be cautious
                       __oscilloscope_h_debug__("vTaskDelete for reader task skipped.");
                   }
               } else {
                    __oscilloscope_h_debug__("oscReader task confirmed stopped.");
               }

          } else {
              char errorMsg[100];
              snprintf(errorMsg, sizeof(errorMsg), "[oscilloscope] Timed out waiting for oscReader task to start (state=%d).", (int)sharedMemory.oscReaderState);
               __oscilloscope_h_debug__(errorMsg);
               webSocket->sendString(errorMsg);
               // Reader task might be stuck, try to signal stop
               sharedMemory.oscReaderState = STOP;
               delay(10); // Give it a moment
               if (oscReaderHandle) { 
                    // vTaskDelete(oscReaderHandle); // Risky delete
                    __oscilloscope_h_debug__("vTaskDelete for non-started reader task skipped.");
               }
          }
      }

      // --- Cleanup --- 
      __oscilloscope_h_debug__("Cleaning up oscilloscope resources.");
      // De-initialize ADC unit if it was initialized
      if (adc1_handle) {
          __oscilloscope_h_debug__("Deleting ADC1 unit handle.");
          esp_err_t del_err = adc_oneshot_del_unit(adc1_handle); // Delete the unit
           if (del_err != ESP_OK) {
                char errorMsg[100];
                snprintf(errorMsg, sizeof(errorMsg), "[oscilloscope] Error deleting ADC1 unit: %s", esp_err_to_name(del_err));
                __oscilloscope_h_debug__(errorMsg);
                // Non-fatal, just log
           }
          adc1_handle = NULL;
      }
      // GPIOs configured via gpio_config are typically reset on program end or reconfigured if needed later.

      __oscilloscope_h_debug__("runOscilloscope finished.");

      // --- REMOVE OLD TASK STARTUP/CLEANUP --- 
      /* 
      // check the values and calculate derived values
      // ... old validation ...
      // choose the corect oscReader
      // ... old reader selection ...
      sharedMemory.oscReaderState = INITIAL;
      // ... old xTaskCreate ...
      if (pdPASS != taskCreated) {
            // ... old error handling ...
      } else {
                // send oscReader START signal and wait until STARTED
                sharedMemory.oscReaderState = START; 
                while (sharedMemory.oscReaderState == START) delay (1); 
        // start oscilloscope sender in this thread
        oscSender ((void *) &sharedMemory); 
        // stop reader - we can not simply vTaskDelete (oscReaderHandle) since this could happen in the middle of analogRead which would leave its internal semaphore locked
                // send oscReader STOP signal
                sharedMemory.oscReaderState = STOP; 
                // wait until oscReader STOPPED or error
                while (sharedMemory.oscReaderState != STOPPED) delay (1); 
      }
      return; // Remove this if the new logic includes the final return
      */
      // --- END REMOVE OLD TASK STARTUP/CLEANUP ---
     }
 #endif
 
